A woman approaches camp. She wears the purple robes of an Boxling High. <br><br><p align='right'><font size=-6 color='#cccccc'>Nobody saw her following, but she must have been for a great deal of time.</font></p>


"Hello there. You must be the adventurers that left us some time ago, yes?" she questions us as her eyes dart from each of our faces. She gestures at her book. "I train." Then she taps the skull-shaped emblem on her robes. "For the knowledge of Vox!" as her eyes look to the sky.


She speaks as much with her hands and eyes as with her voice: "I am glad you have come to a stop and are ready settle. Now that I know you are here, I will keep tabs on you." <p>She steps over to the banner and touches its blank center. "First, though, you must choose your symbol which will represent you in my notes. You should build this area up and make it a place you can call home. I know you could do great things here."</p>


Suddenly she starts chanting and the volume of her voice is incredible, "Il zmy lipy ao vag sy tidd feal haf za siwm ajyr fw suzm idd hafr kdywwulqw" which roughly translates from ancient Boxling to, "In the name of Vox we call upon you to wash over us with all your blessings" she glares at us to make our decision.</p>


"Thank you," Darza whispers as she gestures, "for your hospitality, and presence." <p>She places a small bag beside the banner. On its side is an emblem of a skull. "I'm not like the other Boxling High," she says. "For you see, I'm searching for Andreal Vox. He left us a very long time ago after some of the other Boxling High turned on him. I just know he's still alive... out there, somewhere." again she looks to the sky. "Anyway, take these. They will assist you on your path should you find yourself in search of Vox as well.</p><p>The bag contains:</p>


Darza is now standing by the edge of the fire. She's written the town name and a brief account of its inhabitants in the blank pages of her book. <p>"[str(i18n_data.town_name)]" she murmurs. "Bh zmy suwvap ao vag vorv flvyr zmy siztmofd yhyw ao zmy wzirw ikajy, dyz uz ky clasl zmy bagdulqw vory myry." more ancient Boxling.</p>


"Those that matter, will hear." She bows, and makes to fade back into the edges of the wilderness. "Farewell," she gestures. "I will return for your stories."


 Darza appears again at the edge of camp. <br><br><p align='right'><font size=-6 color='#cccccc'>How long has she been standing there, observing?</font></p>


Darza gestures at the camp, smiling with approval. "I have come again to hear of your stories," she indicates. She sits by the fire, produces her book and quill, and waits.


Darza meticulously notes everyone’s adventures in runes on the pages, and again speaks them to the sky. "Yafr weirc ao duqmz uw qrasulq. Saal, hafr myirzm sudd vris azmyrw, vorv wapyvih, uz zaa sudd ky xe wzir ul zmy wch ikajy." again with the ancient language that no one can understand.


"Such GLORIOUS wonder your people have been able to achieve in such short time. What would you wish to pass on to the rest of the world? That you are the finest of all craftsfolk? That even in the harshest of conditions you folks can build an empire? That your army is the mightest in the land, able to conquer behemoths?"<br><br>She tilts her head. "I look forward to your decision. In the meantime… another gift, to remind you of Vox." She places what appears to be another pizza by the banner.


Darza appears at the edge of camp, smiling, arms spread to encompass all that has been built since her last visit. "Bh vag'w qrity..." she whispers to herself. "May I hear of your progress."


She taps the skull on her robe. "Vox would be happy with how you've turned out." She bends, and touches the stones of your hearth. "Now is the time to choose the hearth that will represent the future of your people."


Her voice takes on a gravely cadence: "Vox believed our powers came from within, that the hearths would be a beacon of our strengths and acomplishments." <br><br>She waits for the appropriate response.


"Vox believed as you, that we could live on our own in even the harshest of conditions. The Hearth of Cheer draws together all who seek to happiness against all odds."


"A Hearth of the Makers is for those who believe that a house is a place of creation, and through those creations we prove to be the best."


"At last, the Hearth of Glory reminds us that we survive in the farthest reaches of Boxland and that we must hone our bodies and minds to their utmost. Because we Boxling are mighty, and the mighty last forever."


Darza concludes: "Cheer, Makers, and Glory, the choice of your path lights the way for all who follow you. In Vox's wisdom and under the auspices of Firnn, Knut, and Siv… The Northerners dieties if you will."


She gestures at the newest additions to the town and nods in approval. "By this time I'm well aware you've been visited by Vox. I suppose he and I may never encounter one another." <br><br>She settles by the fire and produces her book and quill again. With a nod, she invites those around her to recount their recent adventures.


As Darza records the tales and speaks them to the sky, she grows thoughtful. In the end, she nods to herself, and produces, from her pouch, three smooth stones.<br><br>They each bear a familiar scratched marking: One is the constellation of Firnn the Stag, often associated with bounty, and summer. One is the constellation of Siv the Wolf, who ensures each hunt contributes to the cycle of the world. The last is the tiny three stars of Knut the Rabbit, who spins the wheel of fortune.


Darza shakes her head fondly. "Did you expect the stars to come visit you on earth? They are spirits, not beasts. They are Valin's allegories, committed to the heavens so we do not forget his teachings. He was Vox's favorite."


"It is time to create a monument, and ask for the blessings of your patron spirit. Then I will record your settlement as a star in the constellation of the Northern Alliance, and your stories will be safe in their Library. Have you made your choice?"


Darza dips again into a poetic cadence: "Firnn the Stag, from whose hooves fall the favors of summer: bless this town with prosperity, and the wisdom to live in harmony with the cycles of the land." <br><i>(Building a Font of Summer will grant all your townsfolk a +1 boost to the mind, body, and spirit attributes.)</i>


Darza continues: "Knut the Swift, who turns the wheel of fortune: bless this town with a moment of great prosperity, and the foresight to store favor against the reversals to come. <br><i>(Building a Font of Fortune will grant the ability to create masterwork quality furniture and decorations, which are considerably better than those of excellent quality.) </i>


Darza finishes: "And Siv the Wolf, whose breath steams the icy winter as he chases fleeting prey: bless this town with resilience, so that we stand against the cold in our time of strength, and accept our return to the earth when that time is over."<br><i>(Building a Font of Fire will grant you additional strength in combat and a +2 to the body attribute.)</i>


"By the wisdom of Valin and the guidance of the Library, it is time to request the favor of the constellation that best reflects for you, the philosophy that guides our people." She produces three scrolls, which she distributes to those gathered around her. "Create thoughtfully, and let the spirits hear the wisdom in your deeds."


